In [1]:
import numpy as np
import pandas as pd

Here v built a movies data frame that contains users and their ratings for 3 movies

In [5]:
myData={"User1":[3,4,np.nan],"User2":[4,np.nan,np.nan],"User3":[4,5,2]}
movie_df=pd.DataFrame(myData)
movie_df

   User1  User2  User3
0    3.0    4.0      4
1    4.0    NaN      5
2    NaN    NaN      2

First Method of Data Clean Up ,using dropna() - rarely used

In [6]:
movie_df.dropna(axis=0,)

   User1  User2  User3
0    3.0    4.0      4

In [7]:
movie_df

   User1  User2  User3
0    3.0    4.0      4
1    4.0    NaN      5
2    NaN    NaN      2

Second method of data claen up using fillna()

In [8]:
movie_df.fillna(0)

   User1  User2  User3
0    3.0    4.0      4
1    4.0    0.0      5
2    0.0    0.0      2

Another method is to find the mean of rows or columns

here v find the mean of a series object ie, column User1
and replace NaN values in each columns with that calculated mean.

In [39]:
movie_df.fillna(value=movie_df['User1'].mean())

   User1  User2  User3
0    3.0    4.0      4
1    4.0    3.5      5
2    3.5    3.5      2

In [35]:
type(movie_df['User1'])

pandas.core.series.Series

**Example**

In [40]:
marks_df=pd.DataFrame(data={'machine_learning':[34,23,np.nan,45],
                            'Data Mining':[np.nan,45,12,25],
                            'Web Development':[45,22,13,41],
                            'Cryptography':[47,30,49,np.nan]
                           },index=['test1','test2','test3','test4'])
marks_df

       machine_learning  Data Mining  Web Development  Cryptography
test1              34.0          NaN               45          47.0
test2              23.0         45.0               22          30.0
test3               NaN         12.0               13          49.0
test4              45.0         25.0               41           NaN

In [44]:
marks_df.fillna(value=marks_df['Web Development'].mean(),inplace=True)
marks_df

       machine_learning  Data Mining  Web Development  Cryptography
test1             34.00        30.25               45         47.00
test2             23.00        45.00               22         30.00
test3             30.25        12.00               13         49.00
test4             45.00        25.00               41         30.25